import Breadcrum from "@/components/common/Breadcrum";
import { Lang } from "@/types";
import React from "react";

export default function page({ params }: { params: { lang: Lang } }) {
  const heading =
    params.lang === "en" ? "About School" : "विद्यालयको पृष्ठभूमि";
  return (
    <div>
      <Breadcrum bg="/about/about-school.png" heading={heading} />

      <div className=" my-8 space-y-20 px-4 ">
        {/* DESCRIPTION OF SCHOOL */}
        <div className=" mx-auto  max-w-5xl space-y-2 text-justify text-sm leading-7  tracking-wide">
          <span className="text-3xl font-bold">
            विद्यालयको ऐतिहासिक पृष्ठभूमि:
          </span>{" "}
          <p className="text-lg ">
            नेपालको सुदुरपूर्वको सुन्दर पहाडी जिल्ला इलामको सदरमुकामबाट ४७
            कि.मि. पश्चिममा रहेको साविक एकतप्पा, हाल फाकफोकथुम गाउँपालिका वडा
            नं. ६ र ७ को संगम र रमणीय स्थल शिकारी भञ्ज्याङ्गमा अवस्थित श्री
            सिंहदेवी माध्यमिक विद्यालय, फाकफोकथुम–७, एकतप्पाको ऐतिहासिक
            पृष्ठभूमि फरक र फराकिलो प्रकृतिको पाइन्छ ।
          </p>
          <p className="text-lg ">
            वि.सं. २००७ सालको क्रान्तिपछि धेरैमा शैक्षिक चेतना आए पश्चात् वि.सं.
            २००८ सालमा साविक एकतप्पा-४ निवासी स्वर्गीय पण्डित तारानाथ पौडेलले
            आफ्नै घरमा केही ब्राह्मण, क्षेत्री, राई र लिम्बुका छोराछोरीहरुलाई
            रुद्री, चण्डी पढाउने र तमसुक लेख्न सिकाई विद्यालयको शुरुआत गर्नुभएको
            थियो । आफ्नो घरमा पठनपाठन गराउँदै गर्दा पढ्ने चेलाहरु धेरै भएपछि
            नजिकैको आफ्नै बारीमा पातीले बारेर सानो कटेरो निर्माण गरि पढाउन
            थाल्नुभयो । त्यहाँ पनि जमिन साँगुरो भएपछि वि.सं. २०१४ सालमा स्थानीय
            स्वर्गीय हरिप्रसाद भट्टराईले स्थानीय रामध्वज राईसँग जग्गा मागी
            शिकारी भञ्ज्याङ्गमा पातीले बारेको कटेरो निर्माण गरि विधिवत पाठशाला
            निर्माण गरि पठनपाठन संचालन गर्नुभयो । स्वर्गीय हरिप्रसाद भट्टराईको
            नेतृत्वमा स्वर्गीय तारानाथ पौडेल लगायत स्थानीय बुद्धिजीविहरुको
            सहयोगमा शिकारी भञ्ज्याङ्गमा संचालित विद्यालयको नाम श्री हरिउदय
            प्राथमिक विद्यालय राखी भूमि दान र चन्दा संकलन गरी शिक्षकहरुलाई
            तलवभत्ताको व्यवस्था गरिएको कुरा स्थानीय बुढापाकाहरु बताउनुहुन्छ ।
            यसै सन्दर्भमा तत्कालीन सांसद गणेशप्रसाद रिजालले श्री हरिउदय
            विद्यालयलाई स्वीकृति दिलाएका थिए । कक्षा ५ सम्म संचालित यो
            विद्यालयको विद्यालय सहयोग समितिमा श्री हरिप्रसाद भट्टराई सेक्रेटरी र
            सदस्यहरुमा श्री तारानाथ पौडेल, श्री नेगेन्द्र खनाल, श्री डिल्लीसिंह
            खड्का, श्री लालबहादुर भुजेल, श्री नन्दसिंह अधिकारी र श्री कुष्माखर
            खनाल कोषाध्यक्ष पदमा रहि विद्यालयको चौतर्फि विकास गर्ने काम अगाडि
            बढाउनुभयो । स्वर्गीय श्री हरिप्रसाद भट्टराई, श्री तारानाथ पौडेल र
            श्री नेत्रसिंह लिम्बुको नेतृत्वमा साथै अन्य सहयोग समितिको सहयोगमा
            विद्यालय संचालन हुँदै गर्दा वि.सं. २०२६ सालमा तत्कालीन प्राथमिक
            तहलाई अपग्रेडिङ्गको लागि तत्कालीन प्रधानाध्यापक श्री तुलसीराम
            शर्माले आवश्यक प्रक्रिया शुरु गरि सोहि अवधिमा श्री हरिउदय प्रा.वि.
            लाई मिडिल स्कुलको रुपमा संचालन गर्नुभयो । वि.सं. २०२८ सालमा
            राष्ट्रिय शिक्षा पद्दतिको योजना लागू भएपछि यस विद्यालयको नाम
            परिवर्तन गरि श्री सिंहदेवी मन्दिरको नामबाट श्री सिंहदेवी निम्न
            माध्यमिक विद्यालय रहन गयो । यसै क्रममा वि.सं. २०३३ देखि २०४३ साल
            सम्म तत्कालीन विद्यालय व्यवस्थापन समितिका अध्यक्ष श्री नेत्रसिंह
            लिम्बुको नेतृत्व र विद्यालयका प्रधानाध्यापक श्री जगत बोहोराको
            सक्रियतामा साविक एकतप्पा गा.वि.सका सम्पूर्ण अभिभावकहरुको श्रमदान
            सहयोगमा खेलमैदानको निर्माण कार्य सम्पन्न भयो । जसबाट आज पनि यस
            क्षेत्रका सम्पूर्ण खेलप्रेमीहरु लाभान्वित भएका छन् । वि.सं. २०४६
            सालमा तत्कालीन विद्यालय व्यवस्थापन समितिका अध्यक्ष श्री
            गोविन्दप्रसाद कोइरालाको नेतृत्वमा निम्न माध्यमिक विद्यालयलाई
            माध्यमिक बनाउने क्रमका बक्षा ८ संचालन शुरु गरियो । यो माध्यमिक तह
            बनाउने क्रममा अध्यक्ष श्री गोविन्दप्रसाद कोइराला, प्रधानाध्यापक श्री
            हरिप्रसाद प्रधान, श्री तारानाथ पौडेल, श्री जयनारायण भट्टराई, श्री
            धनबहादुर भट्टराई, श्री भीष्म खनाल, श्री तीर्थराज मिश्र, श्री
            नगेन्द्र खनाल, श्री केदारनाथ खनाल, श्री पहलमान कोइराला, श्री
            चन्द्रबहादुर श्रेष्ठ, श्री विद्यापति नेपाल लगायतले प्रत्यक्ष र
            अप्रत्यक्ष रुपमा अन्य धेरै जनाले आर्थिक सहयोग जुटाउने क्रममा आम
            अभिभावहरुको ठूलो योगदान रहेको छ । वि.सं. २०४८ सालमा यस विद्यालयबाट
            प्रथम पटक एस.एल.सी. प्रवेशिका परीक्षामा विद्यार्थी सामेल गराई ७ जना
            विद्यार्थीहरु:
            <ul className="mt-4 list-disc pl-8">
              <li>मैयादेवी थापा (फाकफोक)</li>
              <li>टीकाराम कट्टेल (फाकफोक)</li>
              <li>बालकृष्ण भट्टराई (फाकफोक)</li>
              <li>खम्बसिंह बस्नेत (फाकफोक)</li>
              <li> हरिामाया तामाङ (फाकफोक)</li>
              <li>पदमबहादुर तामाङ (फाकफोक)</li>
              <li>रणश्वर लिम्बु (एकतप्पा) उत्तीर्ण भएका थिए ।</li>
            </ul>
            <br />
            यहाँका अभिभावहरुको निरन्तर चन्दा सहयोगमा वि.सं. २०५१ सालसम्म
            विद्यालय नीजि स्तरमा संचालन भयो । वि.सं. २०५२ सालमा विद्यालय
            माध्यमिक तह स्वीकृत भई शिक्षक दरवन्दीहरु प्राप्त भएपछि विद्यालय
            संचालनमा सहजता सृजना भयो । शिक्षा प्रति नेतृत्व वर्गको उच्च आकांक्षा
            एवं समुदायको सक्रिय साथ र सहयोगका कारण तत्कालीन विद्यालय व्यवस्थापन
            समितिका अध्यक्ष श्री रामकुमार श्रेष्ठ र प्रधानाध्यपक श्री
            नगेन्द्रराज उपाध्ययको नेतृत्व साथै शिक्षा प्रेमी श्री भीष्म खनाल
            लगायतका अभिभावहरुको सक्रिय सहयोगमा वि.सं. २०६३ सालदेखि उच्च माध्यमिक
            तह -१-+१२_ संचालन भइरहेको छ । उच्च माध्यमिक तहसम्मको शिक्षाले मात्र
            यहाँका शिक्षाप्रेमी, समाजसेवी तथा अभिभावकहरु सन्तुष्ट हुने मात्र
            होइन, आजको यस क्षेत्रको आश्यकता महसुस गरी शिक्षा प्रतिको अभिलाषा र
            तृष्णलाई पूरा गर्न वि.सं. २०६८/०८/२८ गते यस ठाउँमा{" "}
            <span className="font-semibold">
              एकतप्पा बहुमुखी क्याम्पस{" "}
            </span>{" "}
            समेत संचालनमा रहेको छ ।
          </p>
          <div className="py-2">
            <h3 className="text-2xl font-semibold"> भौगोलिक अवस्थिति:</h3>
            <p className="mt-2 text-lg">
              इलाम जिल्लाको सदरमुकाम इलामबाट ४७ किलोमिटर पश्चिम २६ डिग्री, २८
              मिनेट १.५ सेकेण्ड उत्तरी अक्षांश देखि १७ डिग्री ५ सेकेण्ड उत्तरी
              अक्षांश र ८७ डिग्री ४७ मिनेट १८ सेकेण्ड पूर्वी देशान्तर देखि ८७
              डिग्री ४९ मिनेट १३ सेकेण्ड पूर्वी देशान्तर भित्र रहेको साविक
              एकतप्पा गा.वि.स. हाल फाकफोकथुम गाउँपालिका वडा नं. ६ र ७ को संगम
              स्थल शिकारी भञ्ज्याङ्गमा यो विद्यालय अवस्थित छ । करीव २३.४२ वर्ग
              किलोमिटर क्षेत्रफल भएको यो एकतप्पा समुद्री सतहबाट ५३० मिटरदेखि
              १९५९ मिटर सम्मको उचाइमा फैलिएको छ । यो श्री सिंहदेवी माध्यमिक
              विद्यालय समुद्री सतहदेखि करीव १४८६ मिटरको उचाइमा रहेको छ । पूर्वमा
              देउमाई खोला, पश्चिममा तिवा खोला र फाकफोक खोलाको बीचमा रहेको यो
              एकतप्पा उत्तरतर्फ फराकिलो र दक्षिण तर्फ साँगुरो हुँदै गएको छ ।
              समग्रमा सलामी तथा समथर भू–बनोट भएको फाकफोकथुम गाउँपालिका वडा नं. ६
              र ७ मा लेकदेखि फाँटिलो उर्वरशील भूमि भएको वेंशी समेत रहेको छ ।
              धेरै हरियाली र जैविक विविधता समेत रहेको यस एकतप्पामा मध्यम किसिमको
              हावापानी पाइन्छ ।
            </p>
          </div>
          <div className="py-2">
            <h3 className="text-2xl font-semibold"> विद्यालय समुदायको बनोट:</h3>
            <p className="mt-2 text-lg">
              यस श्री सिंहदेवी माध्यमिक विद्यालय (१-१२) को सेवा क्षेत्रभित्र
              ब्राह्मण, क्षेत्री, राई, लिम्बू, नेवार, गुरुङ, तामाङ, भुजेल र दलित
              भएको मिश्रित बसोबास रहेको छ। सबै जातजातीले आ-आफ्नो परम्परा
              अनुसारको धर्म, संस्कृति अनुसारका चाडपर्वहरु मनाउँछन्। जातीय,
              धार्मिक, भाषिक, सांस्कृतिक विविधता भए तापनि धार्मिक सहिष्णुता,
              आपसी सद्भाव र एकता यहाँको विशेषता हो।
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}
